HelligeChris/PRJ4/Tryksensor - PsoC6/TrykControl.cydsn/codegentemp/Batteri_ADC.h
/***************************************************************************//**
* \file     Batteri_ADC.h
* \version  3.10
*
* \brief
* Provides the source code to the API for the Batteri_ADC Component.
*
********************************************************************************
* \copyright
* (c) 2017-2018, Cypress Semiconductor Corporation. All rights reserved.
* This software, including source code, documentation and related
* materials ("Software"), is owned by Cypress Semiconductor
* Corporation ("Cypress") and is protected by and subject to worldwide
* patent protection (United States and foreign), United States copyright
* laws and international treaty provisions. Therefore, you may use this
* Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, nonexclusive,
* non-transferable license to copy, modify, and compile the
* Software source code solely for use in connection with Cypress's
* integrated circuit products. Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO
* WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,
* BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE. Cypress reserves the right to make
* changes to the Software without notice. Cypress does not assume any
* liability arising out of the application or use of the Software or any
* product or circuit described in the Software. Cypress does not
* authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/
#if !defined(CY_Batteri_ADC_H)
#define CY_Batteri_ADC_H

#include <cy_device_headers.h>
#include <sar/cy_sar.h>

#define Batteri_ADC_VREF_ROUTED                  ((0) == 1u)
#if (Batteri_ADC_VREF_ROUTED)
#include "Batteri_ADC_vrefAMux.h"
#endif

#define Batteri_ADC_CLOCK_INTERNAL               ((1) == 1u)
#if (Batteri_ADC_CLOCK_INTERNAL)
#include "Batteri_ADC_intSarClock.h"
#endif /* Batteri_ADC_CLOCK_INTERNAL */

/**
* \addtogroup group_structures
*
*/
typedef struct
{
    uint32_t channelBase;                   /* Start of channels for the configuration */
    uint32_t numChannels;                   /* Number of channels in the configuration */
    const cy_stc_sar_config_t *hwConfigStc; /* PDL structure */
    uint32_t miscConfig;                    /* Miscellaneous configuration bits broken down as follows:
                                            [0] - Freerunning: Set if the sample mode is freerunning
                                            [2] - Mux Switch 0: Set when VSSA is used for the neg input to any single-ended channel
                                            */
#if (Batteri_ADC_CLOCK_INTERNAL)
    uint32_t clkDivider;                    /* Clock divider */
#endif /* Batteri_ADC_CLOCK_INTERNAL */

} Batteri_ADC_CONFIG_STRUCT;
/** @} structures */

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
void Batteri_ADC_SelectConfig(uint32_t config, uint32_t restart);
void Batteri_ADC_InitConfig(const Batteri_ADC_CONFIG_STRUCT *config);
void Batteri_ADC_Init(void);
__STATIC_INLINE void Batteri_ADC_Enable(void);

/**
* \addtogroup group_general
* @{
*/
void Batteri_ADC_Start(void);
void Batteri_ADC_StartEx(cy_israddress userIsr);
__STATIC_INLINE void Batteri_ADC_Stop(void);
void Batteri_ADC_StartConvert(void);
__STATIC_INLINE void Batteri_ADC_StopConvert(void);
void Batteri_ADC_SetConvertMode(cy_en_sar_start_convert_sel_t mode);
void Batteri_ADC_SetEosMask(uint32_t mask);
uint32_t Batteri_ADC_IsEndConversion(cy_en_sar_return_mode_t retMode);
__STATIC_INLINE int16_t Batteri_ADC_GetResult16(uint32_t chan);
__STATIC_INLINE int32_t Batteri_ADC_GetResult32(uint32_t chan);
__STATIC_INLINE void Batteri_ADC_SetLowLimit(uint32_t lowLimit);
__STATIC_INLINE void Batteri_ADC_SetHighLimit(uint32_t highLimit);
__STATIC_INLINE void Batteri_ADC_SetLimitMask(uint32_t limitMask);
__STATIC_INLINE void Batteri_ADC_SetSatMask(uint32_t satMask);
__STATIC_INLINE cy_en_sar_status_t Batteri_ADC_SetOffset(uint32_t chan, int16_t offset);
__STATIC_INLINE cy_en_sar_status_t Batteri_ADC_SetGain(uint32_t chan, int32_t adcGain);
__STATIC_INLINE float32_t Batteri_ADC_CountsTo_Volts(uint32_t chan, int16_t adcCounts);
__STATIC_INLINE int16_t Batteri_ADC_CountsTo_mVolts(uint32_t chan, int16_t adcCounts);
__STATIC_INLINE int32_t Batteri_ADC_CountsTo_uVolts(uint32_t chan, int16_t adcCounts);

/** @} general */

void Batteri_ADC_SetChanMask(uint32_t enableMask);

/**
* \addtogroup group_power
* @{
*/
__STATIC_INLINE void Batteri_ADC_Sleep(void);
__STATIC_INLINE void Batteri_ADC_Wakeup(void);

/** @} power */

/**
* \addtogroup group_interrupt
* @{
*/
void Batteri_ADC_ISR(void);
void Batteri_ADC_IRQ_Enable(void);
void Batteri_ADC_IRQ_Disable(void);

/** @} interrupt */

/*******************************************************************************
                                  Parameters
The parameters that are set in the customizer are redefined as constants here.
*******************************************************************************/

/*  Sample Mode setting constants */
#define Batteri_ADC_TOTAL_CONFIGS                (1ul)

/* ************************************************************************** */
/* Begin configuration 0 customizer defines                                   */
/* ************************************************************************** */

