HelligeChris/PRJ4/Tryksensor - PsoC6/TrykControl.cydsn/codegentemp/Batteri_ADC.h
    /* Clock parameters*/
    #if (Batteri_ADC_CLOCK_INTERNAL)
        #define Batteri_ADC_CFG2_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (Batteri_ADC_CFG2_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (Batteri_ADC_CLOCK_INTERNAL) */
#endif /* (Batteri_ADC_TOTAL_CONFIGS > 2) */


/* ************************************************************************** */
/* End configuration 2 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 3 customizer defines                                   */
/* ************************************************************************** */
#if(Batteri_ADC_TOTAL_CONFIGS > 3)
    #define Batteri_ADC_CFG3_SAMPLE_RATE             ()
    #define Batteri_ADC_CFG3_CHANNEL_BASE            (u)
    #define Batteri_ADC_CFG3_CHANNEL_COUNT           (u)
    #define Batteri_ADC_CFG3_VREF_SEL_MASK           (u)
    #define Batteri_ADC_CFG3_NOMINAL_CLOCK_FREQ      (u)
    #define Batteri_ADC_CFG3_CHANNEL_EN              (u)

    /* Sample Control Register */
    #define Batteri_ADC_CFG3_SINGLE_ENDED_FORMAT     (uL)
    #define Batteri_ADC_CFG3_DIFFERENTIAL_FORMAT     (uL)
    #define Batteri_ADC_CFG3_SAMPLES_AVERAGED        (uL)
    #define Batteri_ADC_CFG3_RANGE_INTR_MASK         (u)
    #define Batteri_ADC_CFG3_SATURATE_INTR_MASK      (u)
    #define Batteri_ADC_CFG3_VNEG_INPUT_SEL          ()
    #define Batteri_ADC_CFG3_SINGLE_PRESENT          ()
    #define Batteri_ADC_CFG3_VREF_MV_VALUE           ()
    #define Batteri_ADC_CFG3_APERTURE_TIME0          (uL)
    #define Batteri_ADC_CFG3_APERTURE_TIME1          (uL)
    #define Batteri_ADC_CFG3_APERTURE_TIME2          (uL)
    #define Batteri_ADC_CFG3_APERTURE_TIME3          (uL)
    #define Batteri_ADC_CFG3_FREERUNNING             (u)
    #define Batteri_ADC_CFG3_AVGERAGING_MODE         (uL)
    #define Batteri_ADC_CFG3_LOW_LIMIT               (u)
    #define Batteri_ADC_CFG3_HIGH_LIMIT              (u)
    #define Batteri_ADC_CFG3_RANGE_COND              (uL)
    #define Batteri_ADC_CFG3_USE_SOC                 (0uL)
    #define Batteri_ADC_CFG3_VREF_PWR                (uL)
    #define Batteri_ADC_CFG3_COMP_PWR                (uL)
    #define Batteri_ADC_CFG3_COMP_DLY                (uL)

    /* Clock parameters*/
    #if (Batteri_ADC_CLOCK_INTERNAL)
        #define Batteri_ADC_CFG3_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (Batteri_ADC_CFG3_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (Batteri_ADC_CLOCK_INTERNAL) */
#endif /* (Batteri_ADC_TOTAL_CONFIGS > 3) */

/* ************************************************************************** */
/* End configuration 3 customizer defines                                     */
/* ************************************************************************** */

#define Batteri_ADC_DEFAULT_SAMPLE_MODE_SEL      (0u)
#define Batteri_ADC_FREERUNNING                  (1u)
#define Batteri_ADC_HARDWARESOC                  (1u)
#define Batteri_ADC_NEG_SEL_VSSA_KELVIN          (0x0uL)
#define Batteri_ADC_NEG_SEL_VREF                 (0x7uL)
#define Batteri_ADC_PWR_CTRL_VREF_NORMAL_PWR     (0x0uL)

/** Batteri_ADC_TOTAL_CHANNELS_NUM
* This constant represents the number of input channels available for scanning.
*/
#define Batteri_ADC_TOTAL_CHANNELS_NUM           (1u)

/*******************************************************************************
*    Variables with External Linkage
*******************************************************************************/
/**
* \addtogroup group_globals
* Globals are noted in the descriptions of the functions that use globals.
* They are marked with (R), (W), or (RW) noting whether the variable is read,
* write, or read/write.
* @{
*/

/** Batteri_ADC_initVar
* The Batteri_ADC_initVar variable is used to indicate
* initial configuration of this component. The variable is initialized to zero and
* set to 1 the first time Batteri_ADC_Start() is called. This allows for
* component initialization without reinitialization in all subsequent calls to the
* Batteri_ADC_Start() routine.
*
* If reinitialization of the component is required, then the Batteri_ADC_Init() function
* can be called before the Batteri_ADC_Start() or Batteri_ADC_Enable()
* functions.
*/
extern uint8_t Batteri_ADC_initVar;
extern uint8_t Batteri_ADC_selected;
extern uint32_t Batteri_ADC_currentConfig;

#define Batteri_ADC_INIT_VAR_INIT_FLAG     (0x01u)

extern const Batteri_ADC_CONFIG_STRUCT Batteri_ADC_allConfigs[Batteri_ADC_TOTAL_CONFIGS];

/* SysPm callback structure for deep sleep entry and exit.
 * Call the Cy_SysPm_RegisterCallback function with this
 * structure before calling Cy_SysPm_DeepSleep.
*/
extern cy_stc_syspm_callback_t Batteri_ADC_DeepSleepCallbackStruct;

/** @} globals */

/* ************************************************************************** */
/* *******************Global MUX_SWITCH0 Definitions ************************ */
/* ************************************************************************** */
#if(Batteri_ADC_CFG0_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VSSA_KELVIN)
    /* Do not connect VSSA to VMINUS when one channel in differential mode used */
    #if((Batteri_ADC_TOTAL_CHANNELS_NUM == 1u) && (Batteri_ADC_CFG0_SINGLE_PRESENT == 0u))
        #define Batteri_ADC_MUX_SWITCH0_INIT      0u
    #else    /* multiple channels or one single ended channel */
        #define Batteri_ADC_MUX_SWITCH0_INIT      1u
    #endif /* ((Batteri_ADC_TOTAL_CHANNELS_NUM == 1u) && (Batteri_ADC_CFG0_SINGLE_PRESENT == 0u)) */
#else
    #define Batteri_ADC_MUX_SWITCH0_INIT          0u
#endif /* Batteri_ADC_CFG0_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VSSA_KELVIN */

/* ************************************************************************** */
/* Begin configuration 0 calculated defines                                   */
/* ************************************************************************** */
#define Batteri_ADC_CFG0_SAMPLE_TIME01_INIT \
        ((Batteri_ADC_CFG0_APERTURE_TIME0 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
        | (Batteri_ADC_CFG0_APERTURE_TIME1 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

