HelligeChris/PRJ4/Tryksensor - PsoC6/TrykControl.cydsn/codegentemp/Batteri_ADC.h
    #define Batteri_ADC_CFG1_SAMPLE_TIME23_INIT \
            ((Batteri_ADC_CFG1_APERTURE_TIME2 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
            | (Batteri_ADC_CFG1_APERTURE_TIME3 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

    /* Enable soc pin if used */
    #define Batteri_ADC_CFG1_DSI_TRIGGER_EN_INIT \
            (Batteri_ADC_CFG1_USE_SOC \
            << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

    /* Set soc operation to edge or level based on sample mode */
    #if(Batteri_ADC_CFG1_FREERUNNING == Batteri_ADC_FREERUNNING)
        #define Batteri_ADC_CFG1_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
    #else /* Edge trigger */
        #define Batteri_ADC_CFG1_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End Batteri_ADC_CFG1_FREERUNNING == Batteri_ADC_FREERUNNING */

    /* Set SE_NEG_INPUT */
    #if(Batteri_ADC_CFG1_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VSSA_KELVIN)
        #define Batteri_ADC_CFG1_SE_NEG_INPUT_INIT \
            ((uint32)(Batteri_ADC_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
    #elif(Batteri_ADC_CFG1_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VREF)
        #define Batteri_ADC_CFG1_SE_NEG_INPUT_INIT     (Batteri_ADC_NEG_SEL_VREF \
                                                            << SAR_CTRL_NEG_SEL_Pos )
    #elif (Batteri_ADC_CFG1_SINGLE_PRESENT != 0u)
        #define Batteri_ADC_CFG1_SE_NEG_INPUT_INIT         Batteri_ADC_CFG1_NEG_OTHER
    #else
        #define Batteri_ADC_CFG1_SE_NEG_INPUT_INIT         0u
    #endif /* Batteri_ADC_CFG1_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VSSA_KELVIN */

    #define Batteri_ADC_CFG1_NEG_OTHER                 (uint16)((uint16)Batteri_ADC_SARMUX__VNEG1 << SAR_CTRL_NEG_SEL_Pos)
    #define Batteri_ADC_CFG1_SWITCH_CONF_INIT          0u

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #define Batteri_ADC_CFG1_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk

    #define Batteri_ADC_CFG1_POWER_INIT  (Batteri_ADC_PWR_CTRL_VREF_NORMAL_PWR)

    /* SAMPLE_CTRL initial values */
    #define Batteri_ADC_CFG1_SE_RESULT_FORMAT_INIT \
            (Batteri_ADC_CFG1_SINGLE_ENDED_FORMAT \
            << SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Pos)

    #define Batteri_ADC_CFG1_DIFF_RESULT_FORMAT_INIT \
            (Batteri_ADC_CFG1_DIFFERENTIAL_FORMAT \
            << SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Pos)

    #define Batteri_ADC_CFG1_AVG_SAMPLES_NUM_INIT \
            (Batteri_ADC_CFG1_SAMPLES_AVERAGED \
            << SAR_SAMPLE_CTRL_AVG_CNT_Pos)

    /* Combination of Average Mode and Average Shift */
    #define Batteri_ADC_CFG1_AVG_MODE_INIT \
            (Batteri_ADC_CFG1_AVGERAGING_MODE \
            << SAR_SAMPLE_CTRL_AVG_SHIFT_Pos)

    #define Batteri_ADC_CFG1_TRIGGER_OUT_INIT      (0u)
    #define Batteri_ADC_CFG1_UAB_SCAN_MODE_INIT    (0u)

    #define Batteri_ADC_CFG1_VREF_POWER_INIT  \
            (Batteri_ADC_CFG1_VREF_PWR \
            << SAR_CTRL_PWR_CTRL_VREF_Pos)

    #define Batteri_ADC_CFG1_COMP_PWR_INIT  \
            (Batteri_ADC_CFG1_COMP_PWR \
            << SAR_CTRL_COMP_PWR_Pos)

    #define Batteri_ADC_CFG1_COMP_DLY_INIT  \
            (Batteri_ADC_CFG1_COMP_DLY \
            << SAR_CTRL_COMP_DLY_Pos)

    #define Batteri_ADC_CFG1_CTRL_INIT  \
            (Batteri_ADC_CFG1_VREF_POWER_INIT \
            | Batteri_ADC_CFG1_VREF_SEL_MASK \
            | Batteri_ADC_CFG1_SE_NEG_INPUT_INIT \
            | Batteri_ADC_CFG1_HW_CTRL_NEGVREF_INIT \
            | Batteri_ADC_CFG1_COMP_DLY_INIT \
            | SAR_CTRL_REFBUF_EN_Msk \
            | Batteri_ADC_CFG1_COMP_PWR_INIT \
            | SAR_CTRL_DSI_SYNC_CONFIG_Msk  \
            | Batteri_ADC_CFG1_SWITCH_CONF_INIT )

    #define Batteri_ADC_CFG1_SAMPLE_CTRL_INIT \
            (Batteri_ADC_CFG1_SE_RESULT_FORMAT_INIT \
            | Batteri_ADC_CFG1_DIFF_RESULT_FORMAT_INIT \
            | Batteri_ADC_CFG1_AVG_SAMPLES_NUM_INIT \
            | Batteri_ADC_CFG1_AVG_MODE_INIT \
            | Batteri_ADC_CFG1_DSI_TRIGGER_LEVEL_INIT \
            | Batteri_ADC_CFG1_DSI_TRIGGER_EN_INIT \
            | Batteri_ADC_CFG1_UAB_SCAN_MODE_INIT \
            | SAR_SAMPLE_CTRL_VALID_IGNORE_Msk \
            | Batteri_ADC_CFG1_TRIGGER_OUT_INIT \
            | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk \
    )

    #define Batteri_ADC_CFG1_RANGE_THRES_INIT \
            (Batteri_ADC_CFG1_LOW_LIMIT \
            | (uint32)((uint32)Batteri_ADC_CFG1_HIGH_LIMIT \
            << SAR_RANGE_THRES_RANGE_HIGH_Pos))

    #define Batteri_ADC_CFG1_RANGE_COND_INIT   (cy_en_sar_range_detect_condition_t)Batteri_ADC_CFG1_RANGE_COND

    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
    */
    #define Batteri_ADC_CFG1_MISC_CONFIG_INIT \
            (Batteri_ADC_CFG1_FREERUNNING)
#endif /* Batteri_ADC_TOTAL_CONFIGS > 1 */

/* ************************************************************************** */
/* End configuration 1 calculated defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 2 calculated defines                                   */
/* ************************************************************************** */
#if(Batteri_ADC_TOTAL_CONFIGS > 2)
    #define Batteri_ADC_CFG2_SAMPLE_TIME01_INIT \
            ((Batteri_ADC_CFG2_APERTURE_TIME0 \
            << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
            | (Batteri_ADC_CFG2_APERTURE_TIME1 \
            << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

    #define Batteri_ADC_CFG2_SAMPLE_TIME23_INIT \
            ((Batteri_ADC_CFG2_APERTURE_TIME2 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
            | (Batteri_ADC_CFG2_APERTURE_TIME3 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

    /* Enable soc pin if used */
    #define Batteri_ADC_CFG2_DSI_TRIGGER_EN_INIT \
            (Batteri_ADC_CFG2_USE_SOC \
            << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

    /* Set soc operation to edge or level based on sample mode */
    #if(Batteri_ADC_CFG2_FREERUNNING == Batteri_ADC_FREERUNNING)
        #define Batteri_ADC_CFG2_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
    #else /* Edge trigger */
        #define Batteri_ADC_CFG2_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End Batteri_ADC_CFG2_FREERUNNING == Batteri_ADC_FREERUNNING */

    /* Set SE_NEG_INPUT */
    #if(Batteri_ADC_CFG2_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VSSA_KELVIN)
        #define Batteri_ADC_CFG2_SE_NEG_INPUT_INIT \
            ((uint32)(Batteri_ADC_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
    #elif(Batteri_ADC_CFG2_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VREF)
        #define Batteri_ADC_CFG2_SE_NEG_INPUT_INIT     (Batteri_ADC_NEG_SEL_VREF \
                                                                << SAR_CTRL_NEG_SEL_Pos )
    #elif (Batteri_ADC_CFG2_SINGLE_PRESENT != 0u)
        #define Batteri_ADC_CFG2_SE_NEG_INPUT_INIT         Batteri_ADC_CFG2_NEG_OTHER
    #else
        #define Batteri_ADC_CFG2_SE_NEG_INPUT_INIT         0u
    #endif /* Batteri_ADC_CFG2_VNEG_INPUT_SEL == Batteri_ADC_NEG_SEL_VSSA_KELVIN */

   #define Batteri_ADC_CFG2_NEG_OTHER                 (uint16)((uint16)Batteri_ADC_SARMUX__VNEG2 << SAR_CTRL_NEG_SEL_Pos)

    #define Batteri_ADC_CFG2_SWITCH_CONF_INIT          0u

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #define Batteri_ADC_CFG2_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk

