HelligeChris/PRJ4/Tryksensor - PsoC6/TrykControl.cydsn/codegentemp/Batteri_ADC.h
    #define Batteri_ADC_CFG3_AVG_SAMPLES_NUM_INIT \
            (Batteri_ADC_CFG3_SAMPLES_AVERAGED \
            << SAR_SAMPLE_CTRL_AVG_CNT_Pos)

    /* Combination of Average Mode and Average Shift */
    #define Batteri_ADC_CFG3_AVG_MODE_INIT \
            (Batteri_ADC_CFG3_AVGERAGING_MODE \
            << SAR_SAMPLE_CTRL_AVG_SHIFT_Pos)

    #define Batteri_ADC_CFG3_TRIGGER_OUT_INIT      (0u)
    #define Batteri_ADC_CFG3_UAB_SCAN_MODE_INIT    (0u)

    #define Batteri_ADC_CFG3_VREF_POWER_INIT  \
            (Batteri_ADC_CFG3_VREF_PWR \
            << SAR_CTRL_PWR_CTRL_VREF_Pos)

    #define Batteri_ADC_CFG3_COMP_PWR_INIT  \
            (Batteri_ADC_CFG3_COMP_PWR \
            << SAR_CTRL_COMP_PWR_Pos)

    #define Batteri_ADC_CFG3_COMP_DLY_INIT  \
            (Batteri_ADC_CFG3_COMP_DLY \
            << SAR_CTRL_COMP_DLY_Pos)

    #define Batteri_ADC_CFG3_CTRL_INIT  \
            (Batteri_ADC_CFG3_VREF_POWER_INIT \
            | Batteri_ADC_CFG3_VREF_SEL_MASK \
            | Batteri_ADC_CFG3_SE_NEG_INPUT_INIT \
            | Batteri_ADC_CFG3_HW_CTRL_NEGVREF_INIT \
            | Batteri_ADC_CFG3_COMP_DLY_INIT \
            | SAR_CTRL_REFBUF_EN_Msk \
            | Batteri_ADC_CFG3_COMP_PWR_INIT \
            | SAR_CTRL_DSI_SYNC_CONFIG_Msk  \
            | Batteri_ADC_CFG3_SWITCH_CONF_INIT )


    #define Batteri_ADC_CFG3_SAMPLE_CTRL_INIT \
            (Batteri_ADC_CFG3_SE_RESULT_FORMAT_INIT \
            | Batteri_ADC_CFG3_DIFF_RESULT_FORMAT_INIT \
            | Batteri_ADC_CFG3_AVG_SAMPLES_NUM_INIT \
            | Batteri_ADC_CFG3_AVG_MODE_INIT \
            | Batteri_ADC_CFG3_DSI_TRIGGER_LEVEL_INIT \
            | Batteri_ADC_CFG3_DSI_TRIGGER_EN_INIT \
            | Batteri_ADC_CFG3_UAB_SCAN_MODE_INIT \
            | SAR_SAMPLE_CTRL_VALID_IGNORE_Msk \
            | Batteri_ADC_CFG3_TRIGGER_OUT_INIT \
            | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk \
    )

    #define Batteri_ADC_CFG3_RANGE_THRES_INIT \
            (Batteri_ADC_CFG3_LOW_LIMIT \
            | (uint32)((uint32)Batteri_ADC_CFG3_HIGH_LIMIT \
            << SAR_RANGE_THRES_RANGE_HIGH_Pos))

    #define Batteri_ADC_CFG3_RANGE_COND_INIT   (cy_en_sar_range_detect_condition_t)Batteri_ADC_CFG3_RANGE_COND

    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
    */
    #define Batteri_ADC_CFG3_MISC_CONFIG_INIT \
            (Batteri_ADC_CFG3_FREERUNNING )

#endif /* Batteri_ADC_TOTAL_CONFIGS > 3 */

/* ************************************************************************** */
/* End configuration 3 calculated defines                                     */
/* ************************************************************************** */

/******************************************************************************
* Function Name: Batteri_ADC_Enable
****************************************************************************//*
*
* \brief Enables the component.
*
* \param None
*
* \return None
*
* \sideeffect
*  None
*
*******************************************************************************/
__STATIC_INLINE void Batteri_ADC_Enable(void)
{
    Cy_SAR_Enable(Batteri_ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: Batteri_ADC_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the Batteri_ADC_Stop() API to halt conversions. Instead use the
* Batteri_ADC_StopConvert() API. If you use the Batteri_ADC_Stop() API
* to halt conversions then later use the Batteri_ADC_Start() and
* Batteri_ADC_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The Batteri_ADC_StopConvert() API will enable
* the Batteri_ADC to complete the current scan of channels. After the
* channel scan is complete, the Batteri_ADC will stop all conversions, which
* can be detected by the use of an ISR or the Batteri_ADC_IsEndConversion()
* function.
*
*******************************************************************************/
__STATIC_INLINE void Batteri_ADC_Stop(void)
{
    Cy_SAR_Disable(Batteri_ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: Batteri_ADC_StopConvert
****************************************************************************//**
*
* \brief Forces the Batteri_ADC to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void Batteri_ADC_StopConvert(void)
{
    Cy_SAR_StopConvert(Batteri_ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: Batteri_ADC_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The Batteri_ADC channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int16_t Batteri_ADC_GetResult16(uint32_t chan)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < Batteri_ADC_allConfigs[Batteri_ADC_currentConfig].numChannels);

    return Cy_SAR_GetResult16(Batteri_ADC_SAR__HW, chan);
}

/*******************************************************************************
* Function Name: Batteri_ADC_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The Batteri_ADC channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t Batteri_ADC_GetResult32(uint32_t chan)
{
    int32_t finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < Batteri_ADC_allConfigs[Batteri_ADC_currentConfig].numChannels);

